---
title: python script m4 %25D0%25B4%25D0%25BE%25D0%25BF.%25D0%25B7%25D0%25B0%25D0%25B4%25D0%25B0%25D0%25BD%25D0%25B8%25D0%25B5 1 (snippet)
date: 2020-03-03
tags: ["python"]
---
Python script 'm4 %25D0%25B4%25D0%25BE%25D0%25BF.%25D0%25B7%25D0%25B0%25D0%25B4%25D0%25B0%25D0%25BD%25D0%25B8%25D0%25B5 1'

Functions in program: 
* `def maxNumber(a, b):`

## python m4 %25D0%25B4%25D0%25BE%25D0%25BF.%25D0%25B7%25D0%25B0%25D0%25B4%25D0%25B0%25D0%25BD%25D0%25B8%25D0%25B5 1

Python mysql example: m4 %25D0%25B4%25D0%25BE%25D0%25BF.%25D0%25B7%25D0%25B0%25D0%25B4%25D0%25B0%25D0%25BD%25D0%25B8%25D0%25B5 1

```python
#1. Напишите программу вычисления наибольшего общего делителя двух
#натуральных чисел.

def maxNumber(a, b):
  while a != b :
    if a > b :
        a = a - b
    else:
        b = b - a;
  return a

print("Программа для нахлждения наибольшего общего делителя двух натуральных чисел:")

a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
print(maxNumber(a,b))


```

## Python links

- Learn Python: https://pythonbasics.org/
- Python Tutorial: https://pythonspot.com
