---
title: python script m4 %25D0%25B4%25D0%25BE%25D0%25BF.%25D0%25B7%25D0%25B0%25D0%25B4%25D0%25B0%25D0%25BD%25D0%25B8%25D0%25B5 8 (snippet)
date: 2020-03-03
tags: ["python"]
---
Python script 'm4 %25D0%25B4%25D0%25BE%25D0%25BF.%25D0%25B7%25D0%25B0%25D0%25B4%25D0%25B0%25D0%25BD%25D0%25B8%25D0%25B5 8'


## python m4 %25D0%25B4%25D0%25BE%25D0%25BF.%25D0%25B7%25D0%25B0%25D0%25B4%25D0%25B0%25D0%25BD%25D0%25B8%25D0%25B5 8

Python mysql example: m4 %25D0%25B4%25D0%25BE%25D0%25BF.%25D0%25B7%25D0%25B0%25D0%25B4%25D0%25B0%25D0%25BD%25D0%25B8%25D0%25B5 8

```python
#8. Составить программу, которая позволит определить сколько можно
#купить быков, коров и телят, платя за быка 10 руб., за корову — 5 руб., 
#а за теленка – 0,5 руб., если на 100 руб. надо купить 100 голов скота?

print("Программа по покупке скота")

for b in range(1, 10):
    for k in range(1, 20):
        for t in range(1, 200):
            if (b*10+k*5+t*0.5 == 100) and (b+k+t == 100):
                print('Можно купить', b,'бык.;', k,'кор.;', t,'тел.')

```

## Python links

- Learn Python: https://pythonbasics.org/
- Python Tutorial: https://pythonspot.com
