---
title: python script m4 %25D0%25B4%25D0%25BE%25D0%25BF.%25D0%25B7%25D0%25B0%25D0%25B4%25D0%25B0%25D0%25BD%25D0%25B8%25D0%25B5 3 (snippet)
date: 2020-03-03
tags: ["python"]
---
Python script 'm4 %25D0%25B4%25D0%25BE%25D0%25BF.%25D0%25B7%25D0%25B0%25D0%25B4%25D0%25B0%25D0%25BD%25D0%25B8%25D0%25B5 3'


## python m4 %25D0%25B4%25D0%25BE%25D0%25BF.%25D0%25B7%25D0%25B0%25D0%25B4%25D0%25B0%25D0%25BD%25D0%25B8%25D0%25B5 3

Python mysql example: m4 %25D0%25B4%25D0%25BE%25D0%25BF.%25D0%25B7%25D0%25B0%25D0%25B4%25D0%25B0%25D0%25BD%25D0%25B8%25D0%25B5 3

```python
#3. Напишите программу, которая проверяет, является ли простым
#введенное пользователем положительное целое число. Простым
#называется такое число, которое делится без остатка только на единицу
#и само себя (например, 5, 11, 19).

print("Программа по проверке простого числа:")

n = int(input("Введите число: "))
k = 0

for i in range(2, n -1):
    if n % i == 0:
        k += 1

if k == 0:
    print('Число', n,'простое число')
else:
    print('Число', n,'Не является простым числом')


```

## Python links

- Learn Python: https://pythonbasics.org/
- Python Tutorial: https://pythonspot.com
